{
  "backend/main.mo": "Defines core domain types, maps, and lists for users, patients, staff, assessments, plans, activities, journal entries, tests, affirmations, and access control with mixin storage/authorization.",
  "feature_evidence.json": "Feature evidence report listing implemented Flowers Chain game features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and styling of various frontend components and pages.",
  "frontend/index.css": "Tailwind base setup defining theme variables for light/dark modes and applying global background, text, and border styles.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures the main router, routes for patient and staff pages, and initializes app layout and authentication.",
  "frontend/src/components/assessments/AssessmentTimeline.tsx": "Renders a sorted visual timeline of assessments with dates, vitals, and score details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple access denied UI with icon, message, and navigation link back to the overview page.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout and showing status with icons.",
  "frontend/src/components/auth/ProfileAndRoleSetupModal.tsx": "Modal form for collecting user name, role, and optional patient details, then saving the profile.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wrapper that blocks access unless authenticated and optionally staff, showing loading or denial screens.",
  "frontend/src/components/community/Noticeboard.tsx": "Noticeboard UI for posting messages and displaying existing posts with timestamps.",
  "frontend/src/components/game/flowers-chain/CalmingAudioControls.tsx": "Audio player controls for looping calming music with play/pause, mute, and volume handling.",
  "frontend/src/components/game/flowers-chain/FlowersChainBoard.tsx": "Renders the flowers grid and current chain info, allowing tile selection and chain completion.",
  "frontend/src/components/game/flowers-chain/flowersChainLogic.ts": "Core game logic including board generation, adjacency rules, chain validation, scoring, and board refilling.",
  "frontend/src/components/game/flowers-chain/FlowersChainTile.tsx": "Clickable flower tile displaying an emoji and styling for selection state.",
  "frontend/src/components/game/flowers-chain/useFlowersChainGame.ts": "React hook managing game state, chains, board updates, scoring, moves, and game lifecycle.",
  "frontend/src/components/game/flowers-chain/useRotatingSnippet.ts": "Hook that cycles a random wellness snippet periodically or on demand.",
  "frontend/src/components/game/flowers-chain/wellnessSnippets.ts": "List of wellness text snippets plus helpers to fetch random or specific ones.",
  "frontend/src/components/growth/AchievementsSection.tsx": "Renders a list of achievements based on journal count, completed tests, and streak data, showing unlocked status and conditions. Uses BreezeCard and SectionHeader for layout.",
  "frontend/src/components/home/TodayPanel.tsx": "Displays the daily journal prompt and a recommended test, or a login prompt if the user is not authenticated. Pulls journal entries and test progress to personalize content.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with navigation, theme application, outlet rendering, and a footer. Wraps the app in a ToastProvider.",
  "frontend/src/components/nav/BottomTabBar.tsx": "Mobile-only bottom navigation bar that highlights the active route and links to main app sections. Uses icons and responsive styling.",
  "frontend/src/components/nav/MobileAppBar.tsx": "Top mobile app bar that displays the current page title and a notifications button. Dynamically maps routes to titles with fallbacks.",
  "frontend/src/components/nav/PrimaryNav.tsx": "Desktop navigation bar showing patient or staff routes with active highlighting and mobile menu support. Includes login button and responsive layout.",
  "frontend/src/components/patterns/BreezeCard.tsx": "Reusable card component supporting gradients, images, icons, actions, and clickable behavior. Provides flexible styling and layout for wrapped content.",
  "frontend/src/components/patterns/BreezePrimaryButton.tsx": "Styled primary button with size and variant options, optional icon, and interactive states. Used throughout the UI for main actions.",
  "frontend/src/components/patterns/EmptyState.tsx": "Displays an empty-state card with optional illustration or icon, description, and action button. Uses BreezeCard for consistent styling.",
  "frontend/src/components/patterns/FeatureCard.tsx": "Reusable card component supporting icons, badges, gradients, background images, actions, and custom content.",
  "frontend/src/components/patterns/LoadingState.tsx": "Displays a centered spinner and optional message for loading screens.",
  "frontend/src/components/patterns/SectionHeader.tsx": "Renders a section header with optional icon, subtitle, and action element.",
  "frontend/src/components/patterns/ToastProvider.tsx": "Provides a toast context for showing temporary notifications and renders toast messages on screen.",
  "frontend/src/components/programme/ProgrammeProgressSummary.tsx": "Shows programme completion status with an icon, progress bar, and message.",
  "frontend/src/components/scheduling/AppointmentList.tsx": "Lists appointments with formatted date, time, location, and visual distinction for consultant vs therapy sessions.",
  "frontend/src/components/scheduling/ConsultantSlotPicker.tsx": "Form for booking consultant ward‑round slots, generating 15‑minute intervals and submitting appointments.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useConsultationStatus.ts": "Derives a patient’s consultation status from profile and appointment data.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller’s user profile and determines authentication and role flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for fetching and mutating patient‑related data through an actor API, including profiles, onboarding, appointments, assessments, and plans.",
  "frontend/src/hooks/useThemePreference.ts": "Manages light/dark theme preference using localStorage and updates the document class accordingly.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables, transitions, and custom utility styles.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/patient/AssessmentsPage.tsx": "Displays a patient's assessment timeline with loading and empty states, requiring authentication.",
  "frontend/src/pages/patient/CommunityPage.tsx": "Shows community activities and noticeboard posts with loading and empty UI, gated behind authentication.",
  "frontend/src/pages/patient/ExercisesPage.tsx": "Displays chair‑based exercise plans for the authenticated patient with loading and fallback messaging.",
  "frontend/src/pages/patient/FlowersChainGamePage.tsx": "Renders the Flowers Chain puzzle game UI, including board, score, controls, and instructions.",
  "frontend/src/pages/patient/FollowUpPage.tsx": "Displays patient follow‑up information, fetching programme plans and showing progress or login prompt depending on authentication.",
  "frontend/src/pages/patient/FreeConsultationPage.tsx": "Manages free consultation flow including form submission, profile saving, onboarding, and showing consultation status.",
  "frontend/src/pages/patient/GrowthPage.tsx": "Shows user growth metrics such as journals, tests, and streaks, with loading and login states.",
  "frontend/src/pages/patient/HomeCardDetailsPage.tsx": "Renders detailed content for selected home promo cards with navigation back to the homepage.",
  "frontend/src/pages/patient/HomePage.tsx": "Displays daily affirmation, today panel, and promotional opportunities with sharing and navigation actions.",
  "frontend/src/pages/patient/JournalPage.tsx": "Allows users to create, view, and delete journal entries with authentication checks and toast feedback.",
  "frontend/src/pages/patient/MyProgrammePage.tsx": "Displays the user's latest therapy programme, handles completion updates and help requests, and shows loading or empty states.",
  "frontend/src/pages/patient/OverviewPage.tsx": "Public landing page showing the service overview, hero section, and feature cards, with login-dependent call-to-action.",
  "frontend/src/pages/patient/ProfilePage.tsx": "Allows authenticated users to view and update their profile, manage theme and logout, with loading and unauthenticated states.",
  "frontend/src/pages/patient/SessionsPage.tsx": "Shows a user's upcoming appointments with loading and empty states, sorted by date and grouped by session type.",
  "frontend/src/pages/patient/TestFlowPage.tsx": "Runs a multi-question test flow, managing progress, answers, start/complete logic, and missing-test handling.",
  "frontend/src/pages/patient/TestsPage.tsx": "Displays available tests, user progress, and a quest card with navigation to the next incomplete test.",
  "frontend/src/pages/staff/CaseloadPage.tsx": "Shows patient list and provides a form for staff to create programme plans with interventions and frequency.",
  "frontend/src/pages/staff/DashboardPage.tsx": "Provides staff metrics and forms to add community activities and noticeboard posts.",
  "frontend/src/pages/staff/SchedulingPage.tsx": "Allows staff to book appointments by selecting patient, staff member, time, location, and consultant status.",
  "frontend/src/pages/staff/StaffAssessmentsPage.tsx": "Enables staff to record patient assessments including vitals and multiple scoring fields.",
  "frontend/src/pages/staff/TeamSetupPage.tsx": "Renders a staff team setup dashboard showing teams, roles, capacities, and counts of staff and patients using fetched user data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL params and sessionStorage values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, keyframes, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata describing current features, requirements, assets, and state for a Flowers Chain game website."
}